# pandas data frame

In [1]:
import numpy as np
import pandas as pd

In [2]:
# create dataframe using nested list
list=[["mary",40],["jhon",70],["steve",50],["joe",25]]
data=pd.DataFrame(list,columns=["name","age"],index=[101,102,103,104])

In [3]:
data

      name  age
101   mary   40
102   jhon   70
103  steve   50
104    joe   25

In [7]:
# create dataframe using dictionary
dict={"name":["john","marry","zara","ridaa","joy"],"age":[20,35,40,25,50],
     "salary":[30000,4000,70000,80000,50000],"job":["emgineer","hr","analyst","professor","data science"]}

In [23]:
data=pd.DataFrame(dict)

In [24]:
data

    name  age  salary           job
0   john   20   30000      emgineer
1  marry   35    4000            hr
2   zara   40   70000       analyst
3  ridaa   25   80000     professor
4    joy   50   50000  data science

In [25]:
data.index=[101,102,103,104,105]

In [26]:
# how to create copy of data
data1=data.copy()
data1

      name  age  salary           job
101   john   20   30000      emgineer
102  marry   35    4000            hr
103   zara   40   70000       analyst
104  ridaa   25   80000     professor
105    joy   50   50000  data science

# how to sort data

In [27]:
data1.sort_values("salary")

      name  age  salary           job
102  marry   35    4000            hr
101   john   20   30000      emgineer
105    joy   50   50000  data science
103   zara   40   70000       analyst
104  ridaa   25   80000     professor

In [28]:
data1

      name  age  salary           job
101   john   20   30000      emgineer
102  marry   35    4000            hr
103   zara   40   70000       analyst
104  ridaa   25   80000     professor
105    joy   50   50000  data science

In [22]:
# in the above two tables sort does not change the orginal data

In [29]:
data1.sort_values("salary",inplace=True)

In [30]:
data1

      name  age  salary           job
102  marry   35    4000            hr
101   john   20   30000      emgineer
105    joy   50   50000  data science
103   zara   40   70000       analyst
104  ridaa   25   80000     professor

In [31]:
# inplace= True :It is used to make permanent change
# axis=0 :it is used when row manipulation is done
# ascending= true : sort data in ascending order,by default its ascending
#ascending =False : sort data in decreasing order

In [34]:
# sort data in descending order based on age
data1.sort_values("age",ascending=False,inplace=True)

In [35]:
data1

      name  age  salary           job
105    joy   50   50000  data science
103   zara   40   70000       analyst
102  marry   35    4000            hr
104  ridaa   25   80000     professor
101   john   20   30000      emgineer

# how to rename columns

In [45]:
data1.rename({"name":"emp_name"},axis=1)

    emp_name  emp_age  emp_salary       emp-job
105      joy       50       50000  data science
103     zara       40       70000       analyst
102    marry       35        4000            hr
104    ridaa       25       80000     professor
101     john       20       30000      emgineer

In [38]:
data1

      name  age  salary           job
105    joy   50   50000  data science
103   zara   40   70000       analyst
102  marry   35    4000            hr
104  ridaa   25   80000     professor
101   john   20   30000      emgineer

In [39]:
# to change permnent use inplace
data1.rename({"name":"emp_name"},axis=1,inplace=True)

In [40]:
data1

    emp_name  age  salary           job
105      joy   50   50000  data science
103     zara   40   70000       analyst
102    marry   35    4000            hr
104    ridaa   25   80000     professor
101     john   20   30000      emgineer

In [41]:
data1.rename({'age':'emp_age','salary':'emp_salary',"job":"emp-job"},axis=1,inplace=True)

In [42]:
data1

    emp_name  emp_age  emp_salary       emp-job
105      joy       50       50000  data science
103     zara       40       70000       analyst
102    marry       35        4000            hr
104    ridaa       25       80000     professor
101     john       20       30000      emgineer

# fetching rows and coloumns

In [46]:
data[["name"]]

      name
101   john
102  marry
103   zara
104  ridaa
105    joy

In [47]:
data[["age","job"]]

     age           job
101   20      emgineer
102   35            hr
103   40       analyst
104   25     professor
105   50  data science

## loc and iloc
- loc =label based indexing which helps in fetching rows and coloumns
- iloc =index/integer based indexing

# loc is used fetch rows and coloumns using labels/names

In [48]:
# fetch first column
data.loc[:,["name"]]

      name
101   john
102  marry
103   zara
104  ridaa
105    joy

In [54]:
data.loc[:,["age","job"]]

     age           job
101   20      emgineer
102   35            hr
103   40       analyst
104   25     professor
105   50  data science

In [60]:
data.loc[:,"age":"job"]

     age  salary           job
101   20   30000      emgineer
102   35    4000            hr
103   40   70000       analyst
104   25   80000     professor
105   50   50000  data science

In [61]:
data.loc[[105],:]

    name  age  salary           job
105  joy   50   50000  data science

In [62]:
# fetch 3rd and 5th rows
data.loc[[103,105],:]

     name  age  salary           job
103  zara   40   70000       analyst
105   joy   50   50000  data science

In [63]:
data.loc[103:105,:]

      name  age  salary           job
103   zara   40   70000       analyst
104  ridaa   25   80000     professor
105    joy   50   50000  data science

In [64]:
data.loc[[101,102],["age","salary"]]

     age  salary
101   20   30000
102   35    4000

In [65]:
data.loc[101:102,"age":"salary"]

     age  salary
101   20   30000
102   35    4000

In [85]:
data.loc[103:105,"salary":"job"]
# or 
# data.loc[[103,104,105],["salary","job"]]

     salary           job
103   70000       analyst
104   80000     professor
105   50000  data science

In [73]:
# imp
* loc is label based (column name,rows name)
* loc [row,column]
* data.loc[[row1,row2],[col1,col2]] --- this is used when we have to fetch random rows or coloumn
* data.loc[row1:row2,col1:col2]--- this is used when we have to fetch continuous rows and columns,
*here end value is included

SyntaxError: invalid syntax (1597242292.py, line 4)

In [72]:
# iloc
* iloc is based on index numbers which is used to fetch rows and columns
* end value is not included when slicing is done

In [74]:
# fetch first column
data.iloc[:,[0]]

      name
101   john
102  marry
103   zara
104  ridaa
105    joy

In [75]:
# fetch second and fourth column
data.iloc[:,[1,3]]

     age           job
101   20      emgineer
102   35            hr
103   40       analyst
104   25     professor
105   50  data science

In [78]:
# fech all the column from age using slicing
data.iloc[:,1:4]

     age  salary           job
101   20   30000      emgineer
102   35    4000            hr
103   40   70000       analyst
104   25   80000     professor
105   50   50000  data science

In [79]:
# fetch first row
data.iloc[[0],:]

     name  age  salary       job
101  john   20   30000  emgineer

In [82]:
# fetch 2nd,3rd and 5th row
data.iloc[[1,2,4],:]

      name  age  salary           job
102  marry   35    4000            hr
103   zara   40   70000       analyst
105    joy   50   50000  data science

In [84]:
# fetch every thing from second row using sclicing
data.iloc[1:5,:]

      name  age  salary           job
102  marry   35    4000            hr
103   zara   40   70000       analyst
104  ridaa   25   80000     professor
105    joy   50   50000  data science

In [86]:
data.iloc[1:3,1:3]

     age  salary
102   35    4000
103   40   70000

In [87]:
pwd

'C:\\Users\\punit\\17-APR\\pandas'